# в этом файле постараюсь реализовать логику поиска совпадений через отдельную функцию
# данные хранить планирую в формате json. На момент написания этой заметки, если честно,
# еще не решил как именно. Терзают сомнения стоит ли делить создавать в главном словаре
# ключи с первой буквой фамилии. Во первых, мы не знаем как мы будем записывать наших
# "героев" - допустим ли английский или русский регистр, допустимы ли цифры в фамилии.
# С цифрами, конечно, можно поставить ограничение и скорей всего я так и поступлю.
# Но по остальному пока вопросы.
import json

#
# def findElement(**kwargs):
#     '''
#     '''
#     with open('usersFile.json', 'r', encoding='utf-8') as file:
#         userDict = json.load(file)



